{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e9\u0001\u0000\u0000\u0000\u00a9\u0000)\u0001\u00da\u0001xr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00fa\u001e<ipython-input-4-535541eebd09>\u00da\b<lambda>\u0006\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "batch_input_shape": [null, 66, 200, 3], "input_dtype": "float32", "output_shape": null, "name": "lambda_1", "trainable": true, "arguments": {}, "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_regularizer": null, "nb_filter": 24, "nb_col": 5, "nb_row": 5, "dim_ordering": "tf", "subsample": [2, 2], "init": "he_normal", "name": "convolution2d_1", "W_regularizer": null, "border_mode": "valid", "bias": true, "activity_regularizer": null, "activation": "linear", "trainable": true, "b_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_regularizer": null, "nb_filter": 36, "nb_col": 5, "nb_row": 5, "dim_ordering": "tf", "subsample": [2, 2], "init": "he_normal", "name": "convolution2d_2", "W_regularizer": null, "border_mode": "valid", "bias": true, "activity_regularizer": null, "activation": "linear", "trainable": true, "b_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_regularizer": null, "nb_filter": 48, "nb_col": 5, "nb_row": 5, "dim_ordering": "tf", "subsample": [2, 2], "init": "he_normal", "name": "convolution2d_3", "W_regularizer": null, "border_mode": "valid", "bias": true, "activity_regularizer": null, "activation": "linear", "trainable": true, "b_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_regularizer": null, "nb_filter": 64, "nb_col": 3, "nb_row": 3, "dim_ordering": "tf", "subsample": [1, 1], "init": "he_normal", "name": "convolution2d_4", "W_regularizer": null, "border_mode": "valid", "bias": true, "activity_regularizer": null, "activation": "linear", "trainable": true, "b_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_regularizer": null, "nb_filter": 64, "nb_col": 3, "nb_row": 3, "dim_ordering": "tf", "subsample": [1, 1], "init": "he_normal", "name": "convolution2d_5", "W_regularizer": null, "border_mode": "valid", "bias": true, "activity_regularizer": null, "activation": "linear", "trainable": true, "b_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_regularizer": null, "output_dim": 100, "init": "he_normal", "input_dim": 1152, "name": "dense_1", "W_regularizer": null, "bias": true, "activity_regularizer": null, "activation": "linear", "trainable": true, "b_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_6"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_regularizer": null, "output_dim": 50, "init": "he_normal", "input_dim": 100, "name": "dense_2", "W_regularizer": null, "bias": true, "activity_regularizer": null, "activation": "linear", "trainable": true, "b_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_7"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_regularizer": null, "output_dim": 10, "init": "he_normal", "input_dim": 50, "name": "dense_3", "W_regularizer": null, "bias": true, "activity_regularizer": null, "activation": "linear", "trainable": true, "b_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_8"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_regularizer": null, "output_dim": 1, "init": "he_normal", "input_dim": 10, "name": "dense_4", "W_regularizer": null, "bias": true, "activity_regularizer": null, "activation": "linear", "trainable": true, "b_constraint": null}}]}